---
type: VertexIndexPair
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# VertexIndexPair

`Autodesk.Revit.DB.VertexIndexPair` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | VertexIndexPair | — | `public VertexIndexPair ( int iTop , int iBottom )` |
| Property | Bottom | — | `public int Bottom { get ; set ; }` |
| Property | Top | — | `public int Top { get ; set ; }` |